<template>
  <div class="app">
    <UISpecialityViMain
      :specialityTitle="specialityTitle"
      :arrDes="arrDes"
      :arrProffesions="arrProffesions"
      :imageSrc="imageSrc"
      :backImage="backImage"
      breadcrumbs="38.02.04 Коммерция (по отраслям)"
    />
    <UISpecialityViBasics
      :arrAbout="arrAbout"
      :arrLearn="arrLearn"
      :arrFeatures="arrFeatures"
      :arrFiles="arrFiles"
      :arrSert="arrSert"
    />
    <MainViApplication />
  </div>
</template>

<script>
export default {
  data() {
    return {
      specialityTitle: `38.02.04 <br />
      КОММЕРЦИЯ(ПО ОТРАСЛЯМ)`,
      arrDes: [
        {
          name: "Начало обучения",
          arrDes: ["01 сен 2024"],
        },
        {
          name: "Продолжительность",
          arrDes: ["2 г 10 мес (база 9 кл)", "1 г 10 мес (база 11 кл)"],
        },
      ],
      backImage: "../assets/images/Speciality/commerce-back.webp",
      arrProffesions: [
        "менеджер по продажам",
        "товаровед",
        "специалист отдела маркетинга",
        "начальник отдела сбыта и закупок",
      ],
      imageSrc: "../assets/images/Speciality/money.svg",
      arrAbout: [
        "Организация коммерческой деятельности",
        "Управление продажами",
        "Маркетинг",
        "Предпринимательство",
        "Менеджмент (по отраслям)",
        "Товароведение продовольственных и непродовольственых товаров",
        "Техническое оснащение торговых организаций и охрана труда",
        "и прочие.",
      ],
      arrLearn: [
        "Организации и ведение коммерческой деятельности в производственных, торговых и сервисных организациях",
        "Организация и управление торгово-сбытовой деятельностью",
        "Организация и проведение экономической и маркетинговой деятельности",
        "Управление ассортиментом, оценка качества и обеспечение сохраняемости товаров",
      ],
      arrFeatures: [
        {
          name: "Особеннсть учебного процесса в колледже",
          des: `Учебный процесс по специальности Коммерция обеспечивают высококвалифицированный преподавательский состав со значительным опытом работы. 
          Для получения прочных востребованных знаний в процессе обучения используются современные образовательные технологии: кейсы, деловые игры,
           «мозговой штурм», критический анализ и др. Значительное время в
           ходе обучения уделяется вопросам использования современных информационных технологий. Студенты обеспечиваются 
           новейшими версиями востребованных программных продуктов.<br><br>
           В рамках профильных учебных дисциплин проводятся встречи с представителями органов государственной власти, руководителями организаций и практикующими работниками.`,
        },
        {
          name: "Что дает наш колледж?",
          des: `ВВКИФПУ обеспечивает всех студентов базами практики, которая проводится на предприятиях различных форм
                собственности города Кирова.<br><br>Образовательное учреждение поддерживает тесные деловые отношения с крупными организациями города.
                В ходе такого сотрудничества организуются встречи, на которых обсуждаются вопросы организации прохождения практики студентов и перспективы
                трудоустройства выпускников.<br><br>`,
        },
      ],
      arrFiles: [
        {
          name: "Образовательная программа",
          imageSrc: "../assets/images/Speciality/word.svg",
        },
        {
          name: "Учебный план",
          imageSrc: "../assets/images/Speciality/xml.svg",
        },
        {
          name: "Рабочая программа",
          imageSrc: "../assets/images/Speciality/jav.svg",
        },
      ],
      arrSert: [
        {
          imageSrc: "./assets/images/Speciality/doc1.png",
          imageOpen: "../assets/images/Speciality/doc1.png",
        },
        {
          imageSrc: "./assets/images/Speciality/doc2.png",
          imageOpen: "../assets/images/Speciality/doc2.png",
        },
        {
          imageSrc: "./assets/images/Speciality/doc3.png",
          imageOpen: "../assets/images/Speciality/doc3.png",
        },
      ],
    };
  },
};
</script>

<style scoped>
.app {
  overflow-x: hidden;
}
</style>
