<template>
  <div class="app">
    <UISpecialityViMain
      :specialityTitle="specialityTitle"
      :arrDes="arrDes"
      :arrProffesions="arrProffesions"
      :imageSrc="imageSrc"
      :backImage="backImage"
      :arrCrumbs="arrCrumbs"
      breadcrumbs="38.02.04 Коммерция (по отраслям)"
    />
    <UISpecialityViBasics
      :arrAbout="arrAbout"
      :arrLearn="arrLearn"
      :arrFeatures="arrFeatures"
      :arrFiles="arrFiles"
      :arrSert="arrSert"
    />
    <MainViApplication />
  </div>
</template>

<script>
export default {
  data() {
    return {
      specialityTitle: `38.02.04 <br />
      Коммерция (по отраслям)`,
      arrCrumbs: [
        {
          name: "38.02.04 Коммерция (по отраслям)",
          path: "/speciality/commerce",
        },
      ],
      arrDes: [
        {
          name: "Начало обучения",
          arrDes: ["01 сен 2024"],
        },
        {
          name: "Продолжительность",
          arrDes: ["2 г 10 мес (база 9 кл)", "1 г 10 мес (база 11 кл)"],
        },
      ],
      backImage: "../assets/images/Speciality/commerce-back.webp",
      arrProffesions: [
        "менеджер по продажам",
        "товаровед",
        "специалист отдела маркетинга",
        "начальник отдела сбыта и закупок",
      ],
      imageSrc: `<svg class="image_opacity" width="100" height="100" viewBox="0 0 100 100" fill="none" xmlns="http://www.w3.org/2000/svg">
<g clip-path="url(#clip0_54_3697)">
<path class="path" d="M42.25 29.3333C42.25 23.6267 50.9248 19 61.625 19C72.3252 19 81 23.6267 81 29.3333C81 35.0399 72.3252 39.6667 61.625 39.6667C50.9248 39.6667 42.25 35.0399 42.25 29.3333ZM61.625 44.8333C58.9719 44.8333 56.4557 44.5363 54.1566 44.0196C50.6458 41.3872 44.8927 39.6667 38.375 39.6667C27.6748 39.6667 19 44.2934 19 50C19 55.7066 27.6748 60.3333 38.375 60.3333C49.0752 60.3333 57.75 55.7066 57.75 50C57.75 49.9251 57.7319 49.8527 57.7293 49.7778H57.75V55.1667C57.75 60.8732 49.0752 65.5 38.375 65.5C27.6748 65.5 19 60.8732 19 55.1667V60.3333C19 66.0399 27.6748 70.6667 38.375 70.6667C49.0752 70.6667 57.75 66.0399 57.75 60.3333V65.5C57.75 71.2066 49.0752 75.8333 38.375 75.8333C27.6748 75.8333 19 71.2066 19 65.5V70.6667C19 76.3732 27.6748 81 38.375 81C49.0752 81 57.75 76.3732 57.75 70.6667V70.46C59.0029 70.5943 60.2972 70.6667 61.625 70.6667C72.3252 70.6667 81 66.0399 81 60.3333V55.1667C81 60.6407 73.0123 65.1099 62.9167 65.4664V60.2998C73.0123 59.9432 81 55.4767 81 50V44.8333C81 50.3074 73.0123 54.7766 62.9167 55.1331V49.9664C73.0123 49.6099 81 45.1433 81 39.6667V34.5C81 40.2066 72.3252 44.8333 61.625 44.8333Z" fill="white"/>
</g>
<defs>
<clipPath id="clip0_54_3697">
<rect width="62" height="62" fill="white" transform="translate(19 19)"/>
</clipPath>
</defs>
</svg>
`,
      arrAbout: [
        "Организация коммерческой деятельности",
        "Управление продажами",
        "Маркетинг",
        "Предпринимательство",
        "Менеджмент (по отраслям)",
        "Товароведение продовольственных и непродовольственых товаров",
        "Техническое оснащение торговых организаций и охрана труда",
        "и прочие.",
      ],
      arrLearn: [
        "Организации и ведение коммерческой деятельности в производственных, торговых и сервисных организациях",
        "Организация и управление торгово-сбытовой деятельностью",
        "Организация и проведение экономической и маркетинговой деятельности",
        "Управление ассортиментом, оценка качества и обеспечение сохраняемости товаров",
      ],
      arrFeatures: [
        {
          name: "Особеннсть учебного процесса в колледже",
          des: `Учебный процесс по специальности Коммерция обеспечивают высококвалифицированный преподавательский состав со значительным опытом работы. 
          Для получения прочных востребованных знаний в процессе обучения используются современные образовательные технологии: кейсы, деловые игры,
           «мозговой штурм», критический анализ и др. Значительное время в
           ходе обучения уделяется вопросам использования современных информационных технологий. Студенты обеспечиваются 
           новейшими версиями востребованных программных продуктов.<br><br>
           В рамках профильных учебных дисциплин проводятся встречи с представителями органов государственной власти, руководителями организаций и практикующими работниками.`,
        },
        {
          name: "Что дает наш колледж?",
          des: `ВВКИФПУ обеспечивает всех студентов базами практики, которая проводится на предприятиях различных форм
                собственности города Кирова.<br><br>Образовательное учреждение поддерживает тесные деловые отношения с крупными организациями города.
                В ходе такого сотрудничества организуются встречи, на которых обсуждаются вопросы организации прохождения практики студентов и перспективы
                трудоустройства выпускников.<br><br>`,
        },
      ],
      arrFiles: [
        {
          name: "Образовательная программа",
          imageSrc: "../assets/images/Speciality/word.svg",
        },
        {
          name: "Учебный план",
          imageSrc: "../assets/images/Speciality/xml.svg",
        },
        {
          name: "Рабочая программа",
          imageSrc: "../assets/images/Speciality/jav.svg",
        },
      ],
      arrSert: [
        {
          imageSrc: "./assets/images/Speciality/doc1.png",
          imageOpen: "../assets/images/Speciality/doc1.png",
        },
        {
          imageSrc: "./assets/images/Speciality/doc2.png",
          imageOpen: "../assets/images/Speciality/doc2.png",
        },
        {
          imageSrc: "./assets/images/Speciality/doc3.png",
          imageOpen: "../assets/images/Speciality/doc3.png",
        },
      ],
    };
  },
};
</script>

<style scoped>
.app {
  overflow-x: hidden;
}
</style>
