<template>
  <div class="app">
    <UISpecialityViMain
      :specialityTitle="specialityTitle"
      :arrDes="arrDes"
      :arrProffesions="arrProffesions"
      :imageSrc="imageSrc"
      :backImage="backImage"
      breadcrumbs="43.02.02 Парикмахерское искусство"
    />
    <UISpecialityViBasics
      :arrAbout="arrAbout"
      :arrLearn="arrLearn"
      :arrFeatures="arrFeatures"
      :arrFiles="arrFiles"
      :arrSert="arrSert"
    />
    <MainViApplication />
  </div>
</template>

<script>
export default {
  data() {
    return {
      specialityTitle: `43.02.02 <br />
      Парикмахерское искусство`,
      arrDes: [
        {
          name: "Начало обучения",
          arrDes: ["01 сен 2024"],
        },
        {
          name: "Продолжительность",
          arrDes: ["2 г 10 мес (база 9 кл)", "1 г 10 мес (база 11 кл)"],
        },
      ],
      backImage: "../assets/images/Speciality/hairdressing-back.webp",
      arrProffesions: [
        "профессиональный парикмахер",
        "профессиональный стилист",
      ],
      imageSrc: `<svg class="image_opacity" width="100" height="100" viewBox="0 0 100 100" fill="none" xmlns="http://www.w3.org/2000/svg">
<g clip-path="url(#clip0_2032_823)">
<path class="path" d="M63.0379 56.7463L62.8024 56.4619L54.6443 46.6064L54.3804 46.2877L54.6442 45.9688L71.9732 25.0283L71.9758 25.0252C72.2625 24.6845 72.4789 24.2903 72.6126 23.8655C72.7463 23.4407 72.7945 22.9936 72.7546 22.5501C72.7147 22.1065 72.5874 21.6753 72.3801 21.2812C72.1727 20.887 71.8894 20.5378 71.5465 20.2537C71.2036 19.9696 70.8078 19.7561 70.382 19.6256L70.5284 19.1481L70.382 19.6256C69.9562 19.4952 69.5088 19.4502 69.0656 19.4935C68.6224 19.5367 68.1921 19.6672 67.7995 19.8775L67.5634 19.4368L67.7995 19.8775C67.4069 20.0878 67.0599 20.3737 66.7783 20.7187L66.7761 20.7214L50.3849 40.5278L49.9997 40.9933L49.6145 40.5278L33.2259 20.7215C33.2259 20.7214 33.2258 20.7214 33.2258 20.7214C32.6547 20.0315 31.8329 19.5968 30.9413 19.5129C30.0497 19.4289 29.1612 19.7026 28.4713 20.2737C27.7814 20.8448 27.3467 21.6666 27.2627 22.5582C27.1787 23.4499 27.4524 24.3384 28.0235 25.0283L28.0235 25.0283L45.3551 45.9662L45.6188 46.2847L45.3554 46.6035L37.2101 56.4615L36.9744 56.7468L36.6327 56.6047C33.8687 55.4552 30.7842 55.3343 27.9386 56.264C25.0931 57.1936 22.675 59.1123 21.1228 61.672C19.5706 64.2317 18.9871 67.2629 19.4782 70.2159C19.9693 73.1689 21.5024 75.8481 23.7994 77.7677C26.0965 79.6872 29.0055 80.72 31.9987 80.6787C34.992 80.6374 37.8713 79.5247 40.1146 77.5425C42.3578 75.5603 43.8164 72.8398 44.2258 69.8744C44.6353 66.909 43.9684 63.895 42.3461 61.3792L42.1478 61.0715L42.3811 60.7895L49.6144 52.0449L49.9997 51.5792L50.385 52.0449L57.6183 60.7895L57.8508 61.0706L57.6541 61.3778C56.1692 63.6967 55.4986 66.4441 55.7483 69.1863C55.9979 71.9286 57.1535 74.5097 59.0327 76.5223C60.9119 78.535 63.4078 79.8647 66.1265 80.3015C68.8453 80.7384 71.632 80.2576 74.0472 78.935C76.4624 77.6124 78.3684 75.5233 79.4646 72.9973C80.5608 70.4713 80.7848 67.6523 80.1011 64.9849C79.4174 62.3175 77.8651 59.9537 75.689 58.2664C73.513 56.5791 70.8371 55.6644 68.0835 55.6665L63.0379 56.7463ZM63.0379 56.7463L63.379 56.605M63.0379 56.7463L63.379 56.605M63.379 56.605C64.8705 55.987 66.4689 55.6681 68.0834 55.6665L63.379 56.605ZM28.7681 72.7949C29.7 73.4175 30.7956 73.7499 31.9164 73.7499C33.4193 73.7499 34.8606 73.1529 35.9233 72.0901C36.986 71.0274 37.583 69.5861 37.583 68.0832C37.583 66.9624 37.2507 65.8669 36.628 64.935C36.0054 64.0031 35.1203 63.2768 34.0849 62.8479C33.0494 62.419 31.9101 62.3068 30.8108 62.5254C29.7116 62.7441 28.7019 63.2838 27.9094 64.0763C27.1169 64.8688 26.5772 65.8785 26.3586 66.9777C26.1399 68.0769 26.2521 69.2163 26.681 70.2517C27.1099 71.2872 27.8362 72.1722 28.7681 72.7949ZM64.9348 72.7949C65.8667 73.4175 66.9623 73.7499 68.083 73.7499C69.5859 73.7499 71.0273 73.1529 72.09 72.0901C73.1527 71.0274 73.7497 69.5861 73.7497 68.0832C73.7497 66.9624 73.4174 65.8669 72.7947 64.935C72.172 64.0031 71.287 63.2768 70.2516 62.8479C69.2161 62.419 68.0767 62.3068 66.9775 62.5254C65.8783 62.7441 64.8686 63.2838 64.0761 64.0763C63.2836 64.8688 62.7439 65.8785 62.5252 66.9777C62.3066 68.0769 62.4188 69.2163 62.8477 70.2517C63.2766 71.2872 64.0029 72.1722 64.9348 72.7949Z" fill="white" stroke="white"/>
</g>
<defs>
<clipPath id="clip0_2032_823">
<rect width="62" height="62" fill="white" transform="translate(19 19)"/>
</clipPath>
</defs>
</svg>
`,
      arrAbout: [
        "Пластическая анатомия человека",
        "Санитария и гигиена парикмахерских услуг",
        "Основы анатомии и физиологии кожи и волос",
        "Пластическая анатомия",
        "Основы декоративной косметики",
        "Основы декоративной косметики",
        "и прочие.",
      ],
      arrLearn: [
        "Организовывать подготовительные работы по обслуживанию заказчика",
        "Анализировать индивидуальные пластические особенности потребителя",
        "Разрабатывать форму прически с учетом индивидуальных особенностей",
        "Анализировать состояние кожи головы и волос",
        "Проводить санитарно-эпидемиологическую обработку контактной зоны при выполнении парикмахерских услуг",
        "Внедрять новые технологии и тенденции моды",
        "Выполнять прически различного назначения",
        "Организовывать заключительные работы по обслуживанию заказчика",
      ],
      arrFeatures: [
        {
          name: "Особеннсть учебного процесса в колледже",
          des: `Учебный процесс обеспечивают высококвалифицированный преподавательский состав со значительным опытом работы. Обучение студентов происходит
          непосредственно в самой лаборатории, где студенты сразу могут применить теоретические знания на практике.`,
        },
        {
          name: "Что дает наш колледж?",
          des: `ВВКИФПУ обеспечивает всех студентов базами практики, которая проводится на предприятиях различных форм
                    собственности города Кирова.<br><br>Образовательное учреждение поддерживает тесные деловые отношения с крупными организациями города.
                    В ходе такого сотрудничества организуются встречи, на которых обсуждаются вопросы организации прохождения практики студентов и перспективы
                    трудоустройства выпускников.<br><br>`,
        },
        {
          name: "Квалификация по диплому",
          des: `По окончании обучения выпускнику присваивается квалификация: «Технолог»`,
        },
      ],
      arrFiles: [
        {
          name: "Образовательная программа",
          imageSrc: "../assets/images/Speciality/word.svg",
        },
        {
          name: "Учебный план",
          imageSrc: "../assets/images/Speciality/xml.svg",
        },
        {
          name: "Рабочая программа",
          imageSrc: "../assets/images/Speciality/jav.svg",
        },
      ],
      arrSert: [
        {
          imageSrc: "./assets/images/Speciality/doc1.png",
          imageOpen: "../assets/images/Speciality/doc1.png",
        },
        {
          imageSrc: "./assets/images/Speciality/doc2.png",
          imageOpen: "../assets/images/Speciality/doc2.png",
        },
        {
          imageSrc: "./assets/images/Speciality/doc3.png",
          imageOpen: "../assets/images/Speciality/doc3.png",
        },
      ],
    };
  },
};
</script>

<style scoped>
.app {
  overflow-x: hidden;
}
</style>
