<template>
  <div class="app">
    <UISpecialityViMainInformation
      :specialityTitle="specialityTitle"
      :arrDes="arrDes"
      :arrProffesions="arrProffesions"
      :imageSrc="imageSrc"
      :backImage="backImage"
      :arrCrumbs="arrCrumbs"
      breadcrumbs="09.02.04 Информационные системы"
    />
    <UISpecialityViBasics
      :arrAbout="arrAbout"
      :arrLearn="arrLearn"
      :arrFeatures="arrFeatures"
      :arrFiles="arrFiles"
      :arrSert="arrSert"
    />
    <MainViApplication />
  </div>
</template>

<script>
export default {
  data() {
    return {
      arrCrumbs: [
        {
          name: "09.02.04 Информационные системы",
          path: "/speciality/information-systems",
        },
      ],
      specialityTitle: `09.02.04<br />
          Информационные системы`,
      arrDes: [
        {
          name: "Начало обучения",
          arrDes: ["01 сен 2024"],
        },
        {
          name: "Продолжительность",
          arrDes: ["3 г 10 мес (база 9 кл)", "2 г 10 мес (база 11 кл)"],
        },
      ],
      backImage: "../assets/images/Speciality/information.webp",
      arrProffesions: [
        "программист информационных систем",
        "системный администратор",
        "администратор компьютерной сети",
        "техник по обслуживанию аппаратных средств",
        "веб-мастер (веб-дизайнер)",
        "ИТ-специалист",
        "администратор базы данных",
        "и многие другие",
      ],
      imageSrc: `<svg class="image_opacity" width="100" height="100" viewBox="0 0 100 100" fill="none" xmlns="http://www.w3.org/2000/svg">
<path class="path" d="M66 21L26 44.094L66 67.1881L66 21ZM44.5359 50.177L29.5359 76.1577L36.4641 80.1577L51.4641 54.177L44.5359 50.177Z" fill="white"/>
</svg>`,
      arrAbout: [
        "Основы алгоритмизации и программирования",
        "Основы проектирования баз данных",
        "Технология разработки программного обеспечения",
        "Разработка и эксплуатация удаленных баз данных",
        "Информационные системы на базе Интернет –технологий",
        "Разработка кода информационных систем",
        "Технические средства информатизации",
        "Интеллектуальные системы и технологии",
        "и прочие",
      ],
      arrLearn: [
        "Разрабатывать программное обеспечение на Delphi, C++, JAVA, PHP и других языках",
        "Эксплуатировать и сопровождать информационные системы и сервисы",
        "Устанавливать и настраивать аппаратное обеспечение для информационных и автоматизированных систем",
        "Выполнять монтаж и настройку компьютерных сетей",
        "Управлять корпоративной сетью предприятия (организации)",
        "Ставить и решать прикладные задачи, используя современные информационно-коммуникационные технологии",
        "Помогать заказчику в оценке и выборе вариантов программного обеспечения",
        "Работать с современным программным обеспечением, выполнять его настройку, тестирование, администрирование",
      ],
      arrFeatures: [
        {
          name: "Особеннсть учебного процесса в колледже",
          des: `Особенностью организации учебного процесса в колледже является его практикоориентированная направленность. Большинство занятий посвящено
          практическому изучению современных автоматизированных систем, систем управления базами данных, автоматизированных систем бухгалтерского учета;
          веб-программированию, программного обеспечения для создания и сопровождения интерактивных веб-сайтов.
           <br><br>В колледже имеются компьютерные классы, оснащенные современными персональными компьютерами на базе многоядерных микропроцессоров и программным
            обеспечением ведущих производителей (Microsoft, Adobe Systems, 1C, Лаборатория Касперского и пр.).`,
        },
        {
          name: "Что дает наш колледж?",
          des: `ВВКИФПУ обеспечивает всех студентов базами практики, которая проводится на предприятиях различных форм
          собственности города Кирова.<br><br>Образовательное учреждение поддерживает тесные деловые отношения с крупными организациями города.
          В ходе такого сотрудничества организуются встречи, на которых обсуждаются вопросы организации прохождения практики студентов и перспективы
          трудоустройства выпускников.<br><br>`,
        },
      ],
      arrFiles: [
        {
          name: "Образовательная программа",
          imageSrc: "../assets/images/Speciality/word.svg",
        },
        {
          name: "Учебный план",
          imageSrc: "../assets/images/Speciality/xml.svg",
        },
        {
          name: "Рабочая программа",
          imageSrc: "../assets/images/Speciality/jav.svg",
        },
      ],
      arrSert: [
        {
          imageSrc: "./assets/images/Speciality/doc1.png",
          imageOpen: "../assets/images/Speciality/doc1.png",
        },
        {
          imageSrc: "./assets/images/Speciality/doc2.png",
          imageOpen: "../assets/images/Speciality/doc2.png",
        },
        {
          imageSrc: "./assets/images/Speciality/doc3.png",
          imageOpen: "../assets/images/Speciality/doc3.png",
        },
      ],
    };
  },
};
</script>

<style scoped>
.app {
  overflow-x: hidden;
}
</style>
