<template>
  <div class="app">
    <UISpecialityViMain
      :specialityTitle="specialityTitle"
      :arrDes="arrDes"
      :arrProffesions="arrProffesions"
      :imageSrc="imageSrc"
      :backImage="backImage"
      breadcrumbs="40.02.02 Правоохранительная деятельность"
    />
    <UISpecialityViBasics
      :arrAbout="arrAbout"
      :arrLearn="arrLearn"
      :arrFeatures="arrFeatures"
      :arrFiles="arrFiles"
      :arrSert="arrSert"
    />
    <MainViApplication />
  </div>
</template>

<script>
export default {
  data() {
    return {
      specialityTitle: `40.02.02 <br />
      Правоохранительная деятельность`,
      arrDes: [
        {
          name: "Начало обучения",
          arrDes: ["01 сен 2024"],
        },
        {
          name: "Продолжительность",
          arrDes: ["3 г 6 мес (база 9 кл)", "2 г 6 мес (база 11 кл)"],
        },
      ],
      backImage: "../assets/images/Speciality/pravoved.webp",
      arrProffesions: [
        "сотрудник полиции",
        "судебный пристав-исполнитель",
        "сотрудник прокуратуры",
        "специалист, секретарь суда",
        "судебный пристав",
        "помощник юриста, юрист",
      ],
      imageSrc: "../assets/images/Speciality/vesi.svg",
      arrAbout: [
        "Теория государства и права",
        "Конституционное право",
        "Гражданское право",
        "Трудовое право",
        "Уголовное право",
        "Уголовный процесс",
        "Тактико-специальная подготовка",
        "Огневая подготовка",
        "Специальная техника",
        "Делопроизводство и режим секретности",
        "Основы управления в правоохранительных органах",
        "и прочие.",
      ],
      arrLearn: [
        "Юридически квалифицировать факты, события и обстоятельства",
        "Принимать решения и совершать юридические действия в точном соответствии с законом",
        "Обеспечивать соблюдение законодательства субъектами права",
        "Осуществлять реализацию норм материального и процессуального права",
        "Осуществлять оперативно-служебные мероприятия в соответствии с профилем подготовки",
        "Обеспечивать законность и правопорядок, безопасность личности, общества и государства, охранять общественный порядок",
        "Осуществлять технико-криминалистическое и специальное техническое обеспечение оперативно-служебной деятельности",
        "Обеспечивать защиту сведений, составляющих государственную тайну, конфиденциального характера и иных охраняемых законом тайн",
      ],
      arrFeatures: [
        {
          name: "Особеннсть учебного процесса в колледже",
          des: `Особенностью организации учебного процесса в колледже является его практикоориентированная направленность. Большинство занятий посвящено
            практическому изучению современных автоматизированных систем, систем управления базами данных, автоматизированных систем бухгалтерского учета;
            веб-программированию, программного обеспечения для создания и сопровождения интерактивных веб-сайтов.
             <br><br>В колледже имеются компьютерные классы, оснащенные современными персональными компьютерами на базе многоядерных микропроцессоров и программным
              обеспечением ведущих производителей (Microsoft, Adobe Systems, 1C, Лаборатория Касперского и пр.).`,
        },
        {
          name: "Что дает наш колледж?",
          des: `ВВКИФПУ обеспечивает всех студентов базами практики, которая проводится на предприятиях различных форм
            собственности города Кирова.<br><br>Образовательное учреждение поддерживает тесные деловые отношения с крупными организациями города.
            В ходе такого сотрудничества организуются встречи, на которых обсуждаются вопросы организации прохождения практики студентов и перспективы
            трудоустройства выпускников.<br><br>`,
        },
      ],
      arrFiles: [
        {
          name: "Образовательная программа",
          imageSrc: "../assets/images/Speciality/word.svg",
        },
        {
          name: "Учебный план",
          imageSrc: "../assets/images/Speciality/xml.svg",
        },
        {
          name: "Рабочая программа",
          imageSrc: "../assets/images/Speciality/jav.svg",
        },
      ],
      arrSert: [
        {
          imageSrc: "./assets/images/Speciality/doc1.png",
          imageOpen: "../assets/images/Speciality/doc1.png",
        },
        {
          imageSrc: "./assets/images/Speciality/doc2.png",
          imageOpen: "../assets/images/Speciality/doc2.png",
        },
        {
          imageSrc: "./assets/images/Speciality/doc3.png",
          imageOpen: "../assets/images/Speciality/doc3.png",
        },
      ],
    };
  },
};
</script>

<style scoped>
.app {
  overflow-x: hidden;
}
</style>
