<template>
  <div class="app">
    <UISpecialityViMain
      :specialityTitle="specialityTitle"
      :arrDes="arrDes"
      :arrProffesions="arrProffesions"
      :imageSrc="imageSrc"
      :backImage="backImage"
      :arrCrumbs="arrCrumbs"
      breadcrumbs="40.02.02 Правоохранительная деятельность"
    />
    <UISpecialityViBasics
      :arrAbout="arrAbout"
      :arrLearn="arrLearn"
      :arrFeatures="arrFeatures"
      :arrFiles="arrFiles"
      :arrSert="arrSert"
    />
    <MainViApplication />
  </div>
</template>

<script>
export default {
  data() {
    return {
      specialityTitle: `40.02.02 <br />
      Правоохранительная деятельность`,
      arrCrumbs: [
        {
          name: "40.02.02 Правоохранительная деятельность",
          path: "/speciality/pravoved",
        },
      ],
      arrDes: [
        {
          name: "Начало обучения",
          arrDes: ["01 сен 2024"],
        },
        {
          name: "Продолжительность",
          arrDes: ["3 г 6 мес (база 9 кл)", "2 г 6 мес (база 11 кл)"],
        },
      ],
      backImage: "../assets/images/Speciality/pravoved.webp",
      arrProffesions: [
        "сотрудник полиции",
        "судебный пристав-исполнитель",
        "сотрудник прокуратуры",
        "специалист, секретарь суда",
        "судебный пристав",
        "помощник юриста, юрист",
      ],
      imageSrc: `<svg class="image_opacity" width="100" height="100" viewBox="0 0 100 100" fill="none" xmlns="http://www.w3.org/2000/svg">
<g clip-path="url(#clip0_53_2699)">
<path class="path" d="M80.8423 46.4728L72.9088 24.9407C71.8161 21.9673 68.6877 20.3398 65.6135 21.1561L52.5857 24.6307V21.5333C52.5702 18.1543 47.4346 18.1569 47.4191 21.5333V26.0076L33.8462 29.6269C30.6042 30.4923 27.9743 32.8896 26.8118 36.0387L19.1626 56.8061C19.0567 57.0929 19.0024 58.4775 19.0024 58.4775C18.8009 68.6145 31.2707 74.6673 38.6306 67.421C40.9323 65.2355 42.2524 62.1614 42.2524 58.989C42.2524 58.989 42.1982 57.098 42.0974 56.8139L34.1666 35.0079C34.4869 34.8452 34.8253 34.7134 35.1792 34.6204L47.4191 31.3551V75.7833H31.9191C28.5401 75.7988 28.5427 80.9344 31.9191 80.9499H68.0858C71.4648 80.9344 71.4622 75.7988 68.0858 75.7833H52.5857V29.9756L65.2337 26.6018L57.9126 46.4702C57.8067 46.7569 57.7524 48.1416 57.7524 48.1416C57.7524 54.6154 62.5858 59.9397 68.7574 60.2626C71.984 60.4331 75.0452 59.3042 77.3806 57.0877C79.6823 54.9022 81.0024 51.828 81.0024 48.6557C81.0024 48.6557 80.9482 46.7569 80.8423 46.4702V46.4728ZM35.9801 55.1166H25.2902L30.6713 40.513L35.9801 55.1166ZM69.3774 30.2985L74.7146 44.7833H64.0402L69.3774 30.2985Z" fill="white"/>
</g>
<defs>
<clipPath id="clip0_53_2699">
<rect width="62" height="62" fill="white" transform="translate(19 19)"/>
</clipPath>
</defs>
</svg>`,
      arrAbout: [
        "Теория государства и права",
        "Конституционное право",
        "Гражданское право",
        "Трудовое право",
        "Уголовное право",
        "Уголовный процесс",
        "Тактико-специальная подготовка",
        "Огневая подготовка",
        "Специальная техника",
        "Делопроизводство и режим секретности",
        "Основы управления в правоохранительных органах",
        "и прочие.",
      ],
      arrLearn: [
        "Юридически квалифицировать факты, события и обстоятельства",
        "Принимать решения и совершать юридические действия в точном соответствии с законом",
        "Обеспечивать соблюдение законодательства субъектами права",
        "Осуществлять реализацию норм материального и процессуального права",
        "Осуществлять оперативно-служебные мероприятия в соответствии с профилем подготовки",
        "Обеспечивать законность и правопорядок, безопасность личности, общества и государства, охранять общественный порядок",
        "Осуществлять технико-криминалистическое и специальное техническое обеспечение оперативно-служебной деятельности",
        "Обеспечивать защиту сведений, составляющих государственную тайну, конфиденциального характера и иных охраняемых законом тайн",
      ],
      arrFeatures: [
        {
          name: "Особеннсть учебного процесса в колледже",
          des: `Особенностью организации учебного процесса в колледже является его практикоориентированная направленность. Большинство занятий посвящено
            практическому изучению современных автоматизированных систем, систем управления базами данных, автоматизированных систем бухгалтерского учета;
            веб-программированию, программного обеспечения для создания и сопровождения интерактивных веб-сайтов.
             <br><br>В колледже имеются компьютерные классы, оснащенные современными персональными компьютерами на базе многоядерных микропроцессоров и программным
              обеспечением ведущих производителей (Microsoft, Adobe Systems, 1C, Лаборатория Касперского и пр.).`,
        },
        {
          name: "Что дает наш колледж?",
          des: `ВВКИФПУ обеспечивает всех студентов базами практики, которая проводится на предприятиях различных форм
            собственности города Кирова.<br><br>Образовательное учреждение поддерживает тесные деловые отношения с крупными организациями города.
            В ходе такого сотрудничества организуются встречи, на которых обсуждаются вопросы организации прохождения практики студентов и перспективы
            трудоустройства выпускников.<br><br>`,
        },
      ],
      arrFiles: [
        {
          name: "Образовательная программа",
          imageSrc: "../assets/images/Speciality/word.svg",
        },
        {
          name: "Учебный план",
          imageSrc: "../assets/images/Speciality/xml.svg",
        },
        {
          name: "Рабочая программа",
          imageSrc: "../assets/images/Speciality/jav.svg",
        },
      ],
      arrSert: [
        {
          imageSrc: "./assets/images/Speciality/doc1.png",
          imageOpen: "../assets/images/Speciality/doc1.png",
        },
        {
          imageSrc: "./assets/images/Speciality/doc2.png",
          imageOpen: "../assets/images/Speciality/doc2.png",
        },
        {
          imageSrc: "./assets/images/Speciality/doc3.png",
          imageOpen: "../assets/images/Speciality/doc3.png",
        },
      ],
    };
  },
};
</script>

<style scoped>
.app {
  overflow-x: hidden;
}
</style>
