<template>
  <div class="app">
    <UISpecialityViMain
      :specialityTitle="specialityTitle"
      :arrDes="arrDes"
      :arrProffesions="arrProffesions"
      :imageSrc="imageSrc"
      :backImage="backImage"
      :arrCrumbs="arrCrumbs"
      breadcrumbs="43.02.10 Туризм"
    />
    <UISpecialityViBasics
      :arrAbout="arrAbout"
      :arrLearn="arrLearn"
      :arrFeatures="arrFeatures"
      :arrFiles="arrFiles"
      :arrSert="arrSert"
    />
    <MainViApplication />
  </div>
</template>

<script>
export default {
  data() {
    return {
      specialityTitle: `43.02.10 <br />
      Туризм`,
      arrCrumbs: [
        {
          name: "43.02.10 Туризм",
          path: "/speciality/tourism",
        },
      ],
      arrDes: [
        {
          name: "Начало обучения",
          arrDes: ["01 сен 2024"],
        },
        {
          name: "Продолжительность",
          arrDes: ["2 г 10 мес (база 9 кл)", "1 г 10 мес (база 11 кл)"],
        },
      ],
      backImage: "../assets/images/Speciality/tourism-back.webp",
      arrProffesions: [
        "специалист по туристским услугам",
        "менеджер по экскурсионной работе",
        "менеджер по внутреннему туризму",
        "менеджер визового отдела",
        "старший менеджер",
        "аниматор и др",
      ],
      imageSrc: `<svg class="image_opacity" width="45" height="52" viewBox="0 0 45 52" fill="none" xmlns="http://www.w3.org/2000/svg">
<path class="path" fill-rule="evenodd" clip-rule="evenodd" d="M43.9238 16.7917C38.8605 -5.57999 5.71629 -5.60583 0.627119 16.7658C-2.34371 29.8892 5.81962 41.0233 12.9496 47.895C18.168 52.9067 26.383 52.9067 31.5755 47.895C38.7313 41.0233 46.8946 29.915 43.9238 16.7917ZM30.3358 21.4675C30.3358 25.9189 26.7272 29.5275 22.2758 29.5275C17.8244 29.5275 14.2158 25.9189 14.2158 21.4675C14.2158 17.0161 17.8244 13.4075 22.2758 13.4075C26.7272 13.4075 30.3358 17.0161 30.3358 21.4675Z" fill="white"/>
</svg>
`,
      arrAbout: [
        "Информационно-коммуникационные технологии в профессиональной деятельности",
        "География туризма",
        "Организация туристской индустрии",
        "Иностранный язык в сфере профессиональной коммуникации",
        "Технология и организация турагентской деятельности",
        "Организация досуга туристов",
        "и прочие.",
      ],
      arrLearn: [
        "Предоставлять турагентские услуги",
        "Предоставлять услуги по сопровождению туристов",
        "Обеспечивать соблюдение законодательства субъектами права",
        "Управлять функциональным подразделением организации",
        "Предоставление туроператорских услуг и прочее",
      ],
      arrFeatures: [
        {
          name: "Особеннсть учебного процесса в колледже",
          des: `Особенностью организации учебного процесса в колледже является его практикоориентированная направленность. Большинство занятий посвящено
              практическому изучению современных автоматизированных систем, систем управления базами данных, автоматизированных систем бухгалтерского учета;
              веб-программированию, программного обеспечения для создания и сопровождения интерактивных веб-сайтов.
               <br><br>В колледже имеются компьютерные классы, оснащенные современными персональными компьютерами на базе многоядерных микропроцессоров и программным
                обеспечением ведущих производителей (Microsoft, Adobe Systems, 1C, Лаборатория Касперского и пр.).`,
        },
        {
          name: "Что дает наш колледж?",
          des: `ВВКИФПУ обеспечивает всех студентов базами практики, которая проводится на предприятиях различных форм
              собственности города Кирова.<br><br>Образовательное учреждение поддерживает тесные деловые отношения с крупными организациями города.
              В ходе такого сотрудничества организуются встречи, на которых обсуждаются вопросы организации прохождения практики студентов и перспективы
              трудоустройства выпускников.<br><br>`,
        },
      ],
      arrFiles: [
        {
          name: "Образовательная программа",
          imageSrc: "../assets/images/Speciality/word.svg",
        },
        {
          name: "Учебный план",
          imageSrc: "../assets/images/Speciality/xml.svg",
        },
        {
          name: "Рабочая программа",
          imageSrc: "../assets/images/Speciality/jav.svg",
        },
      ],
      arrSert: [
        {
          imageSrc: "./assets/images/Speciality/doc1.png",
          imageOpen: "../assets/images/Speciality/doc1.png",
        },
        {
          imageSrc: "./assets/images/Speciality/doc2.png",
          imageOpen: "../assets/images/Speciality/doc2.png",
        },
        {
          imageSrc: "./assets/images/Speciality/doc3.png",
          imageOpen: "../assets/images/Speciality/doc3.png",
        },
      ],
    };
  },
};
</script>

<style scoped>
.app {
  overflow-x: hidden;
}
</style>
