<template>
  <section class="basics">
    <div class="basics__container">
      <div class="basics__menu">
        <UISpecialityViBasicsItem />
      </div>
      <div class="basics__content">
        <UISpecialityViAbout :arrAbout="arrAbout" />
        <UISpecialityViLearn :arrLearn="arrLearn" />
      </div>
    </div>
  </section>
</template>

<script>
export default {
  data() {
    return {
      arrAbout: [
        "Основы алгоритмизации и программирования",
        "Основы проектирования баз данных",
        "Технология разработки программного обеспечения",
        "Разработка и эксплуатация удаленных баз данных",
        "Информационные системы на базе Интернет –технологий",
        "Разработка кода информационных систем",
        "Технические средства информатизации",
        "Интеллектуальные системы и технологии",
        "и прочие",
      ],
      arrLearn: [
        "Разрабатывать программное обеспечение на Delphi, C++, JAVA, PHP и других языках",
        "Эксплуатировать и сопровождать информационные системы и сервисы",
        "Устанавливать и настраивать аппаратное обеспечение для информационных и автоматизированных систем",
        "Выполнять монтаж и настройку компьютерных сетей",
        "Управлять корпоративной сетью предприятия (организации)",
        "Ставить и решать прикладные задачи, используя современные информационно-коммуникационные технологии",
        "Помогать заказчику в оценке и выборе вариантов программного обеспечения",
        "Работать с современным программным обеспечением, выполнять его настройку, тестирование, администрирование",
      ],
    };
  },
};
</script>

<style scoped>
.basics {
  width: 100vw;
  background-image: linear-gradient(
    to right,
    #8001bc 0%,
    #6700eb 30%,
    #00eace 100%
  );
  padding: 60px 0 30px 0;
}
.basics__container {
  display: grid;
  grid-template-columns: 1fr 3fr;
  margin-left: 80px;
}
.basics__content {
  width: 100%;
}
</style>
